/*********************************************************************************************************************/
/*著作所有権 ：小島プレス工業(株) 電子技術部 電子設計課                                                              */
/*テーマ名   ：STEP3　　　　　　　　　　                                                                              */
/*メーカ     ：ルネサスエレクトロニクス                                                                              */
/*デバイス   ：R5F10PPJ(RL78/F13)                                                                                    */
/*ファイル名 ：spi_prag.h                                                                                                */
/*仕様       ：汎用プラグマ宣言                                                                                      */
/*********************************************************************************************************************/
/*履歴                                                                                                               */
/* 2024.**.**：新規作成                                                                                   トラベック */
/*                                                                                                                   */
/*                                                                                                                   */
/*                                                                                                                   */
/*                                                                                                                   */
/*                                                                                                                   */
/*                                                                                                                   */
/*                                                                                                                   */
/*                                                                                                                   */
/*                                                                                                                   */
/*                                                                                                                   */
/*********************************************************************************************************************/
#ifndef  spi_pragma
#define  spi_pragma


#include "../rl78_ca78k0r.h"


#include "./spi_mac.h"        /* マクロ定義ファイル */
#include "./spi_type.h"       /* 型定義ファイル */
#include "./spi_glob.h"       /* グローバル変数宣言ファイル */
#include "./spi_prot.h"       /* 関数プロトタイプ宣言ファイル */
#include "./spi_cnst.h"       /* const変数宣言ファイル */
#include "./spi_stat.h"       /* static変数、関数プロトタイプ宣言ファイル */




#endif /*  spi_pragma */