/*********************************************************************************************************************/
/*著作所有権 ：小島プレス工業(株) 電子技術部 電子設計課                                                              */
/*テーマ名   ：STEP3                                                                                                 */
/*メーカ     ：ルネサスエレクトロニクス                                                                              */
/*デバイス   ：R5F10PPJ(RL78/F13)                                                                                    */
/*ファイル名 ：prot.h                                                                                                */
/*仕様       ：関数プロトタイプ宣言ファイル                                                                          */
/*********************************************************************************************************************/
/*履歴                                                                                                               */
/* 2024.**.**：新規作成                                                                     　　　　　　　トラベック */
/*                                                                                                                   */
/*                                                                                                                   */
/*                                                                                                                   */
/*                                                                                                                   */
/*                                                                                                                   */
/*                                                                                                                   */
/*                                                                                                                   */
/*                                                                                                                   */
/*                                                                                                                   */
/*                                                                                                                   */
/*********************************************************************************************************************/

#ifndef spi_prottype
#define spi_prottype




void Reg_SPI_Set(void);

Spi_char SPI_Send_Receive(Spi_int * const tx_buf, Spi_int tx_num, Spi_int * const rx_buf);
void SPI_Start(void);
void SPI_Stop(void);
void SPI_ReceiveEnd(void);
void SPI_SendEnd(void);








#endif /* spi_prottype */