/*********************************************************************************************************************/
/*著作所有権 ：                                                              */
/*テーマ名   ：CXPI RRCN向け疑似負荷開発                                                                             */
/*メーカ     ：ルネサスエレクトロニクス                                                                              */
/*デバイス   ：R5F10PPJ(RL78/F14)                                                                                    */
/*ファイル名 ：glob.h                                                                                                */
/*仕様       ：グローバル変数宣言ファイル                                                                            */
/*********************************************************************************************************************/
/*履歴                                                                                                               */
/* 2024.**.**：新規作成                                                                                         松川 */
/*                                                                                                                   */
/*                                                                                                                   */
/*                                                                                                                   */
/*                                                                                                                   */
/*                                                                                                                   */
/*                                                                                                                   */
/*                                                                                                                   */
/*                                                                                                                   */
/*                                                                                                                   */
/*                                                                                                                   */
/*********************************************************************************************************************/
#ifndef rl_global
#define rl_global


#ifdef  DEFINE_RL_GLOBAL
    #define    GLOBAL
    #define    GLOBAL_VAL(v) = (v)
#else
    #define    GLOBAL    extern
    #define    GLOBAL_VAL(v)
#endif





#endif /* rl_global */

