/*********************************************************************************************************************/
/*著作所有権 ：小島プレス工業(株) 電子技術部 電子設計課                                                              */
/*テーマ名   ：STEP3                                                                             */
/*メーカ     ：ルネサスエレクトロニクス                                                                              */
/*デバイス   ：R5F10PPJ(RL78/F13)                                                                                    */
/*ファイル名 ：univ.h                                                                                                */
/*仕様       ：統合インクルードファイル                                                                              */
/*********************************************************************************************************************/
/*履歴                                                                                                               */
/* 2024.**.**：新規作成                                                                                   トラベック */
/*                                                                                                                   */
/*                                                                                                                   */
/*                                                                                                                   */
/*                                                                                                                   */
/*                                                                                                                   */
/*                                                                                                                   */
/*                                                                                                                   */
/*                                                                                                                   */
/*                                                                                                                   */
/*                                                                                                                   */
/*********************************************************************************************************************/
#ifndef rl_univ
#define rl_univ

/* メイン制御のヘッダファイルインクルード */

#include "./prag.h"                     /* プラグマ宣言ファイル */

#include "./SPI/spi_prag.h "            /* SPIモジュールプラグマ宣言ファイル */
#include "./DRV/drv_prag.h "            /* SPIモジュールプラグマ宣言ファイル */






#endif /* rl_univ */

