/*********************************************************************************************************************/
/*著作所有権 ：                                                            */
/*テーマ名   ：STEP3                                                                                                */
/*メーカ     ：ルネサスエレクトロニクス                                                                             */
/*デバイス   ：R5F10PPJ(RL78/F13)                                                                                   */
/*ファイル名 ：drv.c                                                                                                */
/*仕様       ：モータードライバー通信                                                                                */
/*********************************************************************************************************************/
/*履歴                                                                                                               */
/* 2024.**.**：新規作成                                                                                   トラベック */
/*                                                                                                                   */
/*                                                                                                                   */
/*                                                                                                                   */
/*                                                                                                                   */
/*                                                                                                                   */
/*                                                                                                                   */
/*                                                                                                                   */
/*                                                                                                                   */
/*                                                                                                                   */
/*                                                                                                                   */
/*********************************************************************************************************************/
#include "../prag.h"
#include "./drv_univ.h"
#include "./spi_prag.h"


/*********************************************************************************************************************/
/*    関数名          : DRV_disable()                                                                             */
/*    機能            : DRV8889のDRVOFF端子を切り替え                                                                */
/*    引数            : なし                                                                                         */
/*    戻り値          : unsigned char                                                                                */
/*    呼び出し関数名  : main()                                                                                       */
/*********************************************************************************************************************/
void DRV_disable(void){
	P5 |= 0x02; 			 /*DRVOFF == HIGH , driver is disable  P51*/
}

/*********************************************************************************************************************/
/*    関数名          : DRV_wakeup()                                                                              */
/*    機能            :  DRV8889のnSLEEPをHIGHにさせて、nSleepは100us以上HIGH 時、DRV8889はwakeup状態になります      */
/*    引数            : なし                                                                                         */
/*    戻り値          : unsigned char                                                                                */
/*    呼び出し関数名  : main()                                                                                       */
/*********************************************************************************************************************/
void DRV_wakeup(void){
	P5 = 0x01;	  		/* nSLEEP == 1 , driver is wakeup* P50*/		
}

/*********************************************************************************************************************/
/*    関数名          : DRV_enable()                                                                                */
/*    機能            : DRV8889のDRVOFF端子を切り替え                                                                          */
/*    引数            : なし                                                                                         */
/*    戻り値          : unsigned char                                                                                */
/*    呼び出し関数名  : main()                                                                                       */
/*********************************************************************************************************************/
void DRV_enable(void){
	P5 &= ~0x02;			/* DRVOFF == 0, nSLEEP == HIGH driver is enable */
}


/*********************************************************************************************************************/
/*    関数名          : DRV_sleep()                                                                                */
/*    機能            : DRV8889のnSLEEPをLowにさせて、nSleepは15us以上Low時、DRV8889はスリーブ状態になります          */
/*    引数            : なし                                                                                         */
/*    戻り値          : unsigned char                                                                                */
/*    呼び出し関数名  : main()                                                                                       */
/*********************************************************************************************************************/
void DRV_sleep(void){
	P5 &= ~0x01;			/* nSLEEP == 0, driver is disable*/
}


/*********************************************************************************************************************/
/*    関数名          :DRV_one_step()                                                                               */
/*    機能            : DRV8889をSPIモータに設定　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　*/
/*    引数            : モータの方向設定                                                                            */
/*    戻り値          : unsigned char                                                                                */
/*    呼び出し関数名  : main()                                                                                       */
/*********************************************************************************************************************/

 Drv_char DRV_one_step(Drv_char input_direction, Drv_char microstep_mode){
	
	Drv_char chec_fun_set_spi = NG;  /* 関数チェック変数*/
	Drv_int send_data = 0x00;	/*送信データ初期*/
	Uint rx = 0U;
	
	 
	send_data = (Drv_int) (WRITE_CMD | (DRV_CTRL3_REGISTER_ADDRESS << 1));
	 
	send_data = ((send_data << 8) |DRV_SET_SPI_MODE | input_direction | microstep_mode);
	
	SPI_Start();
 	SPI_Send_Receive(&send_data, 1, &rx);

	
	return chec_fun_set_spi = OK;	
}
 
