/*********************************************************************************************************************/
/*著作所有権 ：小島プレス工業(株) 電子技術部 電子設計課                                                              */
/*テーマ名   ：STEP3                                                                                                 */
/*メーカ     ：ルネサスエレクトロニクス                                                                              */
/*デバイス   ：R5F10PPJ(RL78/F13)                                                                                    */
/*ファイル名 ：drv_prot.h                                                                                                */
/*仕様       ：関数プロトタイプ宣言ファイル                                                                          */
/*********************************************************************************************************************/
/*履歴                                                                                                               */
/* 2024.**.**：新規作成                                                                     　　　　　　　トラベック */
/*                                                                                                                   */
/*                                                                                                                   */
/*                                                                                                                   */
/*                                                                                                                   */
/*                                                                                                                   */
/*                                                                                                                   */
/*                                                                                                                   */
/*                                                                                                                   */
/*                                                                                                                   */
/*                                                                                                                   */
/*********************************************************************************************************************/

#ifndef drv_prot_h
#define drv_prot_h


void DRV_wakeup(void);
void DRV_disable(void);
void DRV_enable(void);
void DRV_sleep(void);

Drv_char DRV_one_step(Drv_char input_direction, Drv_char microstep_mode);

#endif  /* drv_prot_h*/