/*********************************************************************************************************************/
/*著作所有権 ：                                                              */
/*テーマ名   ：STEP3　　　　　　　　　　                                                                              */
/*メーカ     ：ルネサスエレクトロニクス                                                                              */
/*デバイス   ：R5F10PPJ(RL78/F13)                                                                                    */
/*ファイル名 ：drv_pragma.h                                                                                                */
/*仕様       ：汎用プラグマ宣言                                                                                      */
/*********************************************************************************************************************/
/*履歴                                                                                                               */
/* 2024.**.**：新規作成                                                                                   トラベック */
/*                                                                                                                   */
/*                                                                                                                   */
/*                                                                                                                   */
/*                                                                                                                   */
/*                                                                                                                   */
/*                                                                                                                   */
/*                                                                                                                   */
/*                                                                                                                   */
/*                                                                                                                   */
/*                                                                                                                   */
/*********************************************************************************************************************/
#ifndef  drv_pragma
#define  drv_pragma


#include "../rl78_ca78k0r.h"


#include "./drv_mac.h"        /* マクロ定義ファイル */
#include "./drv_type.h"       /* 型定義ファイル */
#include "./drv_glob.h"       /* グローバル変数宣言ファイル */
#include "./drv_prot.h"       /* 関数プロトタイプ宣言ファイル */
#include "./drv_cnst.h"       /* const変数宣言ファイル */
#include "./drv_stat.h"       /* static変数、関数プロトタイプ宣言ファイル */




#endif /*  drv_pragma */
